def smaller(arr): #შევქმენით ფუნქცია სახელად smaller და პარამეტრად გადავეცით სია - arr.
    result = [] #შევქმენით ცარიელი სია სახელად result.
    count = 0 #შევქმენით ცვალდი სახელად count და მნიშვნელობად მივანიჭეთ 0.
    for i in range(len(arr)): #for loop-ის საშუალებით საიტერაცია ცვლად i-ს მნიშვნელობად მივანიჭეთ რიცხვები 0დან სია arr-ში ელემენტების რაოდენობამდე ანუ  len(arr)-მდე.
        for j in range(i + 1, len(arr)): #for loop ის საშუალებით საიტერაციო ცვალდს j-ის მნიშვნელობად მივანიჭეთ რიცხვები i+1 დან სია arr-ში ელემენტების რაოდენობამდე ანუ  len(arr)-მდე.
            if arr[i] > arr[j]: #პირობით ოპერატორის if-ის საშუალებით ვამოწმებთ სია arr-ში არსებული ელემენტი ინდექსად i მეტია თუ არა მის შემდეგ მყოფ სხვა ელემენტებზე.
                count += 1 #თუ ზემოთ მოცემული პირობა სრულდება და =True, მაშინ ცვლადი count გაიზარდოს 1-ით
        result.append(count) #ჩაშენებული for loop-ის დასრულების შემდეგ, სია result-ში ვამატებთ count-ის მნიშვნელობას
        count = 0 #და count-ს ვუბრუნებთ თავდაპირველ მნიშვნელობას ანუ 0-ს.
    return result #საბოლოოდ ვაბრუნებთ result-ს

