def manual_pop(list,index):
#თავდაპირველად def keyword - ის გამოყენებით ვქიმნით ფუნქციას სახელად manual_pop
#რომელსაც ფრჩხილებში პარამეტრად გადავცემთ სიას სახელად list - ს და ასევე გადავცემთ index ცვლადს.
    new_list = []
#შემდეგ ვქმნით ცარიელ სიას
    if index >= len(list):
        return "invalid number"
#შემდეგ if - ის გამოყენებით ვადგენთ პირობას, რომლის მიხედვითაც თუ index მეტია ან ტოლია len(list) - ის ანუ list - ში 
#არსებულ ელემენტთა რაოდენობაზე დააბრუნოს სტრინგი: invalid number
    for i in list:
        if i != list[index]:
            new_list.append(i)
    return new_list
#შემდეგ for loop - ში საიტერაციო ცვლად i - ის მივანიჭოთ list - ში არსებული ელემენტების მნიშვნელობა ანუ გადავუაროთ სიას
#და ამის შემდეგ for ციკლში if - ის გამოყენებით ვადგენთ შემდეგ პირობას: თუ საიტერაციო ცვლადი i არ უდრის
#list - ს ინდექსად index - ს, მაშინ append ის საშუალებით ცარიელ new_list - სი დავამატოთ i
print(manual_pop([1,2,3,4,5], 3))
#საბოლოოდ print - ის საშუალებით ვიძახებთ ფუნქციას და არგუმენტებად ვანიჭებთ: სიას, რომელშიც ელემენტებად გვაქვს 1,2,3,3,4 და 5
#და მეორე არგუმენტად ვანიჭებთ 3 - ს.
