def manual_max(list):
#თავდაპირველად def keyword - ის გამოყენებით ვქიმნით ფუნქციას სახელად manual_max
#რომელსაც ფრჩხილებში პარამეტრად გადავცემთ სიას სახელად list - ს.
    list.sort()
#sort ფუნქციის საშუალებით მოცემულ სიას ვალაგებთ ზრდადობის მიხედვით
    return list[len(list) - 1]
#ფუნქციის ბოლოს კი return - ის საშუალებით ვაბრუნებთ list - ის ბოლო მნიშვნელობას
print(manual_max([4, 6, 2, -4, 50]))
#აქ ვიძახებთ ფუნქციას რომელსაც არგუმენტად გადავცემთ შემდეგ სიას: [4, 6, 2, -4, 50]
def manual_min(list):
#თავდაპირველად def keyword - ის გამოყენებით ვქიმნით ფუნქციას სახელად manual_min
#რომელსაც ფრჩხილებში პარამეტრად გადავცემთ სიას სახელად list - ს.
    list.sort()
#sort ფუნქციის საშუალებით მოცემულ სიას ვალაგებთ ზრდადობის მიხედვით
    return list[0]
#ფუნქციის ბოლოს კი return - ის საშუალებით ვაბრუნებთ list - პირველ მნიშვნელობას
print(manual_min([4, 6, 2, -4, 50]))
#აქ ვიძახებთ ფუნქციას რომელსაც არგუმენტად გადავცემთ შემდეგ სიას: [4, 6, 2, -4, 50]
